<?php

use Illuminate\Database\Seeder;

class seederNews extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        //
        $data = new \App\Model\news();

        $data->insert([
        [
            'sector_id'=> 1,
            'topic'=> 'ผู้โดยสารสวดยับ รถไฟฟ้า BTS ขัดข้องตั้งแต่ตี 5 ปิดสถานีสำโรง ปลายทางเคหะ' ,
            // 'subTopic'=> '' ,
            'detail'=>'รถไฟฟ้าบีทีเอส แจ้งรถขัดข้องผ่านทวิตเตอร์ @BTS_SkyTrain โดยระบุ 05.00 น. (17 ก.ค. 63) ระบบควบคุมการเดินรถขัดข้องระหว่างสถานีสำโรง ถึงสถานีปลายทางเคหะฯ ทำให้ขบวนรถไม่สามารถให้บริการได้ ตั้งแต่ สถานีปู่เจ้า สถานีช้างเอราวัณ สถานีโรงเรียนนายเรือ สถานีปากน้ำ สถานีศรีนครินทร์ สถานีแพรกษา สถานีสายลวด และสถานีเคหะฯ ต้องปิดสถานีชั่วคราว ผู้โดยสารโปรดพิจารณาการเดินทาง ขออภัยในความไม่สะดวก สำหรับสถานีอื่นๆ และสายสีลม ยังให้บริการตามปกติ

            05.56 น. ขณะนี้ระบบควบคุมการเดินรถขัดข้อง กำลังทำการแก้ไข โดยสามารถเดินรถจากสถานีวัดพระศรีมหาธาตุถึงสถานีแบริ่ง ยังคงทำการปิดสถานีสำโรงถึงสถานีปลายทางเคหะฯ ชั่วคราว ผู้โดยสารโปรดพิจารณาการเดินทาง ขออภัยในความไม่สะดวก

            07.00 น. เนื่องจากระบบควบคุมการเดินรถขัดข้อง กำลังทำการแก้ไข โดยสามารถเดินรถจากสถานีวัดพระศรีมหาธาตุถึงสถานีแบริ่ง ยังคงทำการปิดสถานีสำโรงถึงสถานีปลายทางเคหะฯ ชั่วคราว ผู้โดยสารโปรดพิจารณาการเดินทาง ขออภัยในความไม่สะดวก

            07.45 น. เนื่องจากระบบควบคุมการเดินรถขัดข้อง กำลังทำการแก้ไข โดยจะมีรถให้บริการจากสถานีวัดพระศรีมหาธาตุถึงสถานีแบริ่ง ยังคงปิดสถานีสำโรงถึงสถานีปลายทางเคหะฯ ชั่วคราว การเดินรถในสายสีลม สามารถเดินรถได้ตามปกติ ผู้โดยสารโปรดพิจารณาการเดินทาง ขออภัยในความไม่สะดวก

            08.34 น. เนื่องจากระบบควบคุมการเดินรถขัดข้อง อยู่ระหว่างดำเนินการแก้ไข โดยจะมีรถให้บริการจากสถานีวัดพระศรีมหาธาตุถึงสถานีแบริ่ง ยังคงปิดสถานีสำโรงถึงสถานีปลายทางเคหะฯ ชั่วคราว การเดินรถในสายสีลม สามารถเดินรถได้ตามปกติ ผู้โดยสารโปรดพิจารณาการเดินทาง ขออภัยในความไม่สะดวก',
            'image'=> '2.jpg',
        ],
        [

            'sector_id'=> 1,
            'topic'=> '2 หนุ่มระยองชูป้ายประท้วงบิ๊กตู่ เจอ 4 ข้อหา ผิด พ.ร.ก.ฉุกเฉิน-พ.ร.บ.โรคติดต่อ' ,
            // 'subTopic'=> '' ,
            'detail'=>'รองโฆษก ตร.เผยเจ้าหน้าที่แจ้งข้อหา ตามความผิด พ.ร.ก.ฉุกเฉิน และ พ.ร.บ.ควบคุมโรคติดต่อ กับ 2 หนุ่มระยองหลังถือป้ายประท้วงนายกรัฐมนตรี

            พ.ต.อ.กฤษณะ พัฒนเจริญ รองโฆษกสำนักงานตำรวจ เปิดเผยถึงกรณีการควบคุมตัวบุคคล 2 คน ที่อ้างตัวเป็นตัวแทนกลุ่มเครือข่ายเยาวชนภาคตะวันออก ยืนถือป้ายข้อความ เชิญชวนบุคคลอื่นมาชุมนุม เพื่อรอเจอกับ พล.อ.ประยุทธ์ จันทร์โอชา นายกรัฐมนตรี นั้นได้รับรายงานจาก สภ.เมืองระยอง ว่า เมื่อวันที่ 15 ก.ค. เวลา 16.00 น. ได้มีชาย 2 คน เชิญชวนบุคคลมาชุมนุมในโซเชียล พร้อมกับ ชูป้ายแสดงข้อความ ซึ่งเป็นการแสดงความไม่พอใจ เนื่องจากเป็นคนระยองและไม่พอใจกับสิ่งที่รัฐบาลกระทำ บริเวณหน้าโรงแรมดีวารี ก่อนที่ นายกรัฐมนตรีจะมาตรวจสอบและปฏิบัติราชการในพื้นที่

            ซึ่งเจ้าหน้าที่ตำรวจอาศัยอำนาจเจ้าพนักงานควบคุมโรค ตาม พ.ร.บ.โรคติดต่อ พ.ศ.2558 ได้มีคำสั่งให้บุคคลทั้ง 2 ออกไปจากบริเวณดังกล่าว ในการรักษาความปลอดภัยนายกรัฐมนตรี ซึ่งเป็นบุคคลสำคัญและเป็นการเสี่ยงต่อโรคติดต่อ แต่ปรากฏว่า บุคคลทั้ง 2 ไม่ให้ความร่วมมือและไม่ปฏิบัติตามคำสั่งของ เจ้าพนักงาน ควบคุมโรคฯ จนกระทั่งมีการใช้กำลังในการควบคุม ให้ออกนอกบริเวณดังกล่าว

            ซึ่งมีการต่อสู้ขัดขวางเจ้าพนักงาน จนสามารถควบคุมบุคคลทั้ง 2 ขึ้นรถยนต์ เดินทางมาถึง หน่วยปฏิบัติการพิเศษ ภ.จว.ระยอง ปรากฏว่าบุคคลทั้งสองได้วิ่งหลบหนีเจ้าหน้าที่ตำรวจ แล้วมาปรากฏตัว บริเวณตลาดสตาร์พร้อมกับได้ทำการไลฟ์ผ่านเฟซบุ๊ก หลังจากนั้นจึงมาแจ้งความร้องทุกข์ต่อพนักงานสอบสวนให้ดำเนินคดีกับเจ้าหน้าที่ตำรวจชุดจับกุม กล่าวหาว่า "เป็นเจ้าพนักงานปฏิบัติหน้าที่หรือละเว้นการปฏิบัติหน้าที่โดยมิชอบฯ" โดยพนักงานสอบสวน ได้สอบปากคำผู้เสียหายทั้งสองและส่งตัวให้แพทย์โรงพยาบาลกรุงเทพระยอง ตรวจชันสูตรบาดแผลและทำการรักษา เพื่อจะได้สอบสวนดำเนินการตามกฎหมายต่อไป

            ในส่วนการกระทำของบุคคลทั้งสอง ซึ่งถือเป็นความผิดซึ่งหน้าตั้งแต่ที่ได้มีการควบคุมตัวเพื่อมาดำเนินคดี ภายหลังจากหลบหนีการควบคุม เจ้าหน้าที่ตำรวจได้ทำการสืบสวน รวบรวมพยานหลักฐานเพิ่มเติม และได้กล่าวโทษต่อพนักงานสอบสวน สภ.เมืองระยอง ให้ดำเนินคดีความผิดฐาน',
            'image'=> '1.jpg',
        ],


        ]);

    }
}
